app/controllers/kakao_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."key" = ? LIMIT ?  [["key", "cj51EJa3xat1"], ["LIMIT", 1]]
INSERT INTO "users" ("key", "uk", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["key", "cj51EJa3xat1"], ["uk", 0], ["created_at", "2018-10-18 07:29:10.313521"], ["updated_at", "2018-10-18 07:29:10.313521"]]
SELECT  "sites".* FROM "sites" WHERE "sites"."user_id" = 1 ORDER BY "sites"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "sites".* FROM "sites" WHERE "sites"."user_id" = 1 AND "sites"."sname" = ? ORDER BY "sites"."id" DESC LIMIT ?  [["sname", "이적팬사이트"], ["LIMIT", 1]]
INSERT INTO "sites" ("user_id", "sname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["sname", "Naver"], ["created_at", "2018-10-27 07:55:26.067408"], ["updated_at", "2018-10-27 07:55:26.067408"]]
UPDATE "sites" SET "spw" = ?, "updated_at" = ? WHERE "sites"."id" = ?  [["spw", "사이트 리스트"], ["updated_at", "2018-10-27 07:54:26.976086"], ["id", 1]]
UPDATE "users" SET "flag" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["flag", 3], ["updated_at", "2018-10-27 07:53:58.552638"], ["id", 1]]
---
  def message
    if User.find_by(key: params[:user_key])
      p "유저가 있음"
    else
      p "노 유저"
      if User.create(key: params[:user_key])
        p "유저 생성됨"
      end
    end

    @user_msg = params[:content] #사용자의 입력값
    @cuser = User.find_by(key: params[:user_key])
    @usite = []

    @cuser.sites.each do |s|
      if not @usite.include?(s.sname)
        @usite.push(s.sname)

DELETE FROM "sites" WHERE "sites"."id" = ?  [["id", 1]]
---
      @text ="저장 되었습니다.\n사이트리스트로 돌아갑니다."
      @cuser.update(flag: 0)
    elsif @cuser.flag == -1 && Site.where(user: @cuser, sname: @user_msg).last
      Site.where(user: @cuser, sname: @user_msg).last.destroy